Public Attributes | List of all members
API_HotlinkUserData Struct Reference
Hotlink Manager
Hotlink user data. More...
#include <APIdefs_Database.h>
 Public Attributes
short  | dataVersion
Data version.
unsigned short  | platformSign
Byte ordering in data storage.
GSFlags  | flags
User specified flags.
GSPtr  | data
User specified data.
GS::UniString *  | translatorContent
For XREF node creation only, nullptr otherwise.
Detailed Description
Hotlink user data.
Member Data Documentation
◆ data
 API_HotlinkUserData::data
User specified data.
◆ dataVersion
 API_HotlinkUserData::dataVersion
Data version.
◆ flags
 API_HotlinkUserData::flags
User specified flags.
◆ platformSign
 API_HotlinkUserData::platformSign
Byte ordering in data storage.
◆ translatorContent
 API_HotlinkUserData::translatorContent
For XREF node creation only, nullptr otherwise.